
list_1 = ["Бронницы", "Балашиха", "Видное", "Волоколамск", "Воскресенск", "Высоковск", "Верея", "Голицыно", "Дзержинский", "Долгопрудный", "Дубна", "Дмитров",
                  "Домодедово", "Дрезна", "Дедовск", "Егорьевск", "Егорьевск", "Жуковский", "Звенигород", "Зарайск", "Истра", "Ивантеевка", "Коломна", "Королёв"]

list_2 = ["Красноармейск", "Краснознаменск", "Кашира""Клин", "Котельники", "Красногорск", "Краснозаводск", "Кубинка", "Куровское (Московская)", "Лобня", "Лыткарино", "Ликино-Дулёво",
                  "Лосино-Петровский", "Луховицы", "Люберцы", "Можайск", "Мытищи", "Наро-Фоминск", "Ногинск", "Орехово-Зуево", "Одинцово", "Озёры", "Подольск", "Протвино", "Пущино",]

list_3 = ["Реутов", "Рошаль", "Раменское", "Руза", "Серпухов", "Сергиев Посад", "Солнечногорск", "Ступино", "Старая Купавна", "Талдом",
                  "Фрязино", "Химки", "Хотьково", "Черноголовка", "Чехов", "Шатура", "Щёлково", "Электросталь", "Электрогорск", "Электроугли", "Яхрома", "Павловский Посад", "Пересвет", "Пушкино"]

print(len(list_1))
print(len(list_2))
print(len(list_3))
