import cianparser as cian
from time import sleep

# proxies = [
#   '117.250.3.58:8080', 
#   '115.96.208.124:8080',
#   '152.67.0.109:80', 
#   '45.87.68.2:15321', 
#   '68.178.170.59:80', 
#   '20.235.104.105:3729', 
#   '195.201.34.206:80',
# ]


# moscow_parser = cian.CianParser(location='Москва')
# data = moscow_parser.get_flats(deal_type='sale', rooms='all', with_saving_csv=True, additional_settings={"start_page":1, "end_page":54}, with_extra_data=True)


# for i in cian.list_locations():
#   print(i)


# list_1 = ["Видное", "Волоколамск", "Воскресенск", "Высоковск", "Верея", "Голицыно", "Дзержинский", "Долгопрудный", "Дубна", "Дмитров",
#                   "Домодедово", "Дрезна", "Дедовск", "Егорьевск", "Егорьевск", "Жуковский", "Звенигород", "Зарайск", "Истра", "Ивантеевка", "Коломна", "Королёв"]

# есть ("Красноармейск", "Краснознаменск", , "Котельники", "Красногорск", "Краснозаводск", "Кубинка", "Куровское (Московская)", "Лобня", "Лыткарино", "Ликино-Дулёво", "Кашира","Клин", "Лосино-Петровский",) 

list_2 = []

# list_3 = ["Реутов", "Рошаль", "Раменское", "Руза", "Серпухов", "Сергиев Посад", "Солнечногорск", "Ступино", "Старая Купавна", "Талдом",
#                   "Фрязино", "Химки", "Хотьково", "Черноголовка", "Чехов", "Шатура", "Щёлково", "Электросталь", "Электрогорск", "Электроугли", "Яхрома", "Павловский Посад", "Пересвет", "Пушкино"]

for town in list_2:
  town_parser = cian.CianParser(location=town)
  data = town_parser.get_flats(deal_type='sale', rooms='all', with_saving_csv=True, additional_settings={"start_page":1, "end_page":54}, with_extra_data=True)
  sleep(120)